In [1]:
import numpy as np

In [2]:
import pandas as pd

## Nivel de índices.

In [3]:
afuera = ['G1','G1','G1','G2','G2','G2']

In [4]:
adentro = [1,2,3,1,2,3]

In [10]:
indices = list(zip(afuera,adentro))

In [11]:
indices

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [13]:
type(indices)

list

In [14]:
indices = pd.MultiIndex.from_tuples(indices)

In [15]:
indices

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [16]:
from numpy.random import randn

In [17]:
df = pd.DataFrame(randn(6,2), indices, ['A','B'])

In [18]:
df

             A         B
G1 1  1.055036 -0.971521
   2 -0.770150 -0.012009
   3  1.115825  0.718979
G2 1 -0.321260  0.765044
   2  0.141009  2.005508
   3  0.135481  0.970352

In [21]:
df.loc['G1'].loc[1]

A    1.055036
B   -0.971521
Name: 1, dtype: float64

In [22]:
df.loc['G2'].loc[3]

A    0.135481
B    0.970352
Name: 3, dtype: float64

In [23]:
df.loc['G2'].loc[2]['B']

2.0055079307091792

## Método sección cruzada

In [24]:
df.xs('G1')

          A         B
1  1.055036 -0.971521
2 -0.770150 -0.012009
3  1.115825  0.718979

In [25]:
df.xs(1, level=1)

           A         B
G1  1.055036 -0.971521
G2 -0.321260  0.765044

In [26]:
df.xs(2, level=1)

           A         B
G1 -0.770150 -0.012009
G2  0.141009  2.005508

## Datos perdidos

In [41]:
import numpy as np

In [42]:
import pandas as pd

In [43]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[3,3,2]}

In [44]:
df = pd.DataFrame(d)

In [45]:
df

     A    B  C
0  1.0  5.0  3
1  2.0  NaN  3
2  NaN  NaN  2

In [46]:
df.dropna()

     A    B  C
0  1.0  5.0  3

In [47]:
df.dropna(axis=1)

   C
0  3
1  3
2  2

In [48]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  3
1  2.0  NaN  3

In [49]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  3
1  2.0  NaN  3
2  NaN  NaN  2

In [50]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  3

In [51]:
df['A'].fillna(value=df['C'].mean(),inplace=True)

In [52]:
df

          A    B  C
0  1.000000  5.0  3
1  2.000000  NaN  3
2  2.666667  NaN  2

## Agrupar alias GroupBy

In [71]:
data = {'Compania':['FB','APPLE','C','TERM','SC','IBM'],'Empleado':['Juan','Pedro','Ricardo','Javier','Gerardo','Daniel'],'Ventas':[3456,5678,2345,12566,98654,78654]}

In [72]:
df = pd.DataFrame(data)

In [73]:
df

  Compania Empleado  Ventas
0       FB     Juan    3456
1    APPLE    Pedro    5678
2        C  Ricardo    2345
3     TERM   Javier   12566
4       SC  Gerardo   98654
5      IBM   Daniel   78654

In [74]:
byComp=df.groupby('Compania')

In [75]:
byComp

In [76]:
byComp.sum()

          Ventas
Compania
APPLE       5678
C           2345
FB          3456
IBM        78654
SC         98654
TERM       12566

In [77]:
df.groupby('Compania').max()

         Empleado  Ventas
Compania
APPLE       Pedro    5678
C         Ricardo    2345
FB           Juan    3456
IBM        Daniel   78654
SC        Gerardo   98654
TERM       Javier   12566

In [78]:
df.groupby('Compania').describe()

                 Ventas
Compania
APPLE    count      1.0
         mean    5678.0
         std        NaN
         min     5678.0
         25%     5678.0
         50%     5678.0
         75%     5678.0
         max     5678.0
C        count      1.0
         mean    2345.0
         std        NaN
         min     2345.0
         25%     2345.0
         50%     2345.0
         75%     2345.0
         max     2345.0
FB       count      1.0
         mean    3456.0
         std        NaN
         min     3456.0
         25%     3456.0
         50%     3456.0
         75%     3456.0
         max     3456.0
IBM      count      1.0
         mean   78654.0
         std        NaN
         min    78654.0
         25%    78654.0
         50%    78654.0
         75%    78654.0
         max    78654.0
SC       count      1.0
         mean   98654.0
         std        NaN
         min    98654.0
         25%    98654.0
         50%    98654.0
         75%    98654.0
         max    98654.0
TERM     count      1.0
         mean   12566.0
         std        NaN
         min    12566.0
         25%    12566.0
         50%    12566.0
         75%    12566.0
         max    12566.0

In [79]:
df.describe()

             Ventas
count      6.000000
mean   33558.833333
std    43288.517334
min     2345.000000
25%     4011.500000
50%     9122.000000
75%    62132.000000
max    98654.000000

In [80]:
df.groupby('Compania').describe().transpose()

Compania APPLE                                                         C  \
         count    mean std     min     25%     50%     75%     max count
Ventas     1.0  5678.0 NaN  5678.0  5678.0  5678.0  5678.0  5678.0   1.0

Compania           ...          SC           TERM                        \
            mean   ...         75%      max count     mean std      min
Ventas    2345.0   ...     98654.0  98654.0   1.0  12566.0 NaN  12566.0

Compania
              25%      50%      75%      max
Ventas    12566.0  12566.0  12566.0  12566.0

[1 rows x 48 columns]

In [84]:
df.groupby('Compania').describe().transpose()['APPLE']

        count    mean  std     min     25%     50%     75%     max
Ventas    1.0  5678.0  NaN  5678.0  5678.0  5678.0  5678.0  5678.0

## Concatenaciones

In [87]:
df1= pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})

In [88]:
df2= pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']})

In [89]:
df3= pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']})

In [90]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [91]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [101]:
izquierdo = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                          'C':['C0','C1','C2','C3'],
                          'D':['D0','D1','D2','D3']})

In [104]:
izquierdo

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [107]:
derecho = pd.DataFrame({ 'Key':['K0','K1','K2','K3'],
                         'A':['A0','A1','A2','A3'],
                         'B':['B0','B1','B2','B3']})

In [108]:
derecho

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [109]:
pd.merge(izquierdo, derecho , how='inner', on='Key')

    C   D Key   A   B
0  C0  D0  K0  A0  B0
1  C1  D1  K1  A1  B1
2  C2  D2  K2  A2  B2
3  C3  D3  K3  A3  B3

In [111]:
izquierdo = pd.DataFrame({'C':['C0','C1','C2','C3'],
                          'D':['D0','D1','D2','D3']},
                         index=['K0','K1','K2','K3'])

In [112]:
derecho = pd.DataFrame({ 'A':['A0','A1','A2','A3'],
                         'B':['B0','B1','B2','B3']},
                       index=['K0','K1','K2','K3'])

In [114]:
izquierdo.join(derecho)

     C   D   A   B
K0  C0  D0  A0  B0
K1  C1  D1  A1  B1
K2  C2  D2  A2  B2
K3  C3  D3  A3  B3

In [115]:
derecho.join(izquierdo)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

## Operaciones

In [117]:
df = pd.DataFrame({'col':[1,2,3,4],
                   'col2':[444,555,666,777],
                   'col3':['abc','ced','fgh','ijk']})

In [118]:
df.head

<bound method DataFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  ced
2    3   666  fgh
3    4   777  ijk>

In [119]:
df

   col  col2 col3
0    1   444  abc
1    2   555  ced
2    3   666  fgh
3    4   777  ijk

In [120]:
df['col2'].unique()

array([444, 555, 666, 777])

In [121]:
len(df['col2'].unique())

4

In [122]:
def multiplica2(x):
    return x*2

In [123]:
multiplica2(df)

   col  col2    col3
0    2   888  abcabc
1    4  1110  cedced
2    6  1332  fghfgh
3    8  1554  ijkijk

In [124]:
# CIERRE, lambda es funcion anonima, x son todos los elementos
df.apply(lambda x: x*2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  cedced
2    6  1332  fghfgh
3    8  1554  ijkijk